nxp-mcuxpresso/mcux-sdk-examples/frdmke17z/demo_apps/bubble_peripheral/pin_mux.h
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB0 (number 54), UART0_RX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UART0_RX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_UART0_RX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_UART0_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTB1 (number 53), UART0_TX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UART0_TX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_UART0_TX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_UART0_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTD11 (number 35), D3[4]/RGB_GREEN
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LED_GREEN_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_GREEN_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_LED_GREEN_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTD10 (number 36), D3[1]/RGB_RED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LED_RED_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_RED_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_LED_RED_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTB8 (number 77), J2[20]/U11[2]/Arduino_D15/FXOS_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FXOS_SCL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_FXOS_SCL_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_FXOS_SCL_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTA16 (number 82), J2[18]/U11[3]/FXOS_SDA/Arduino_D14
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FXOS_SDA_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_FXOS_SDA_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_FXOS_SDA_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);

/*! @name PORTB9 (number 76), U13[3]/FXOS_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_FXOS_RST_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_FXOS_RST_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_FXOS_RST_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_FXOS_RST_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_FXOS_RST_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_FXOS_RST_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_ACCEL_Reset(void);

/*! @name PORTB8 (number 77), J2[20]/U11[2]/Arduino_D15/FXOS_SCL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SCL_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SCL_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SCL_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SCL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SCL_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SCL_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORTA16 (number 82), J2[18]/U11[3]/FXOS_SDA/Arduino_D14
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SDA_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SDA_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SDA_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SDA_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SDA_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INIT_I2C_GPIO_PINS_FXOS_SDA_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_I2C_GPIO_pins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
